/*
todo:
add galaxies
add asteroid gravitation???????????????????
*/


export const art = {
  logo: {
    img: `    ___                                          
   /   |  ____ ___  ____  ____  ____ ___  _______
  / /| | / __ \`__ \\/ __ \\/ __ \\/ __ \`/ / / / ___/ඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞ
 / ___ |/ / / / / / /_/ / / / / /_/ / /_/ (__  ) 
/_/  |_/_/ /_/ /_/\\____/_/ /_/\\__, /\\__,_/____/  
                             /____/`,
    width: 83
  },
  ship: {
    width: 8,
    height: 6,
    img: `
<\\  ___
   /  _\\
<=|| |_|
   | _ |
</ || ||
        `,
  },
  buffs: [
    {
      img: `
 ___
/   \\
| + |ඞඞඞඞඞ
\\___/
      `
    },

    //     {
    //       img: `
    // +-+
    // |S|
    // +-+
    //       `
    // }
  ],
  planets: [
    {
      name: 'Moon',
      img: `        
        ඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞ     
        ඞඞඞ       ඞඞඞඞඞඞඞඞ    
       ඞඞඞ   ඞඞඞඞඞඞඞඞඞඞඞඞඞඞ   
       ඞඞඞ   ඞඞඞඞ       ඞඞඞඞඞ 
  ඞඞඞඞඞඞ    ඞඞඞඞ          ඞඞ 
 ඞඞඞඞඞඞඞඞ    ඞඞඞඞඞ          ඞඞඞ 
 ඞඞඞ  ඞඞඞ     ඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞ 
 ඞඞඞ  ඞඞඞ     ඞඞඞඞඞඞඞඞඞඞඞඞඞඞ  
 ඞඞඞඞ ඞඞඞ                ඞඞඞ  
  ඞඞඞඞඞඞඞ     ඞඞඞඞඞඞඞඞඞ  ඞඞ   
       ඞඞ     ඞඞඞ  ඞ ඞ   ඞඞ   
       ඞඞ     ඞඞඞ ඞඞ    ඞඞඞ   
        ඞඞඞඞඞඞඞඞඞඞඞඞඞ ඞඞඞඞඞඞඞඞ    
       ඞඞඞඞඞඞඞඞඞ       `
    }
  ],
  asteroids: [
    {
      width: 6,
      height: 7,
      img: `
  ___
 / _\\
|| |_|
 | _ |
 || ||
    `
    }
  ],
  enemies: [
    {
      width: 10,
      height: 6,
      img: `
  ___
 / _\\
|| |_|
 | _ |
 || ||
    `
    }
  ],
  animations: {
    buffPickedUp: [
      [
        `
 ___
    /   \\
| + |
\\___ /
  `,
        `
___
  / | \\
| -+-|
\\_ | _ /
  `,
        `
___
  / | \\
| -ඞ -|
\\_ | _ /
  `,
        `
___
  / | \\
|=%=|
\\_ | _ /
  `,
        `
___
  / | \\
|+=+|
\\_ | _ /
  `,
        `
___
  / | \\
| ---|
\\_ | _ /
  `,
        `
___
  / | \\
| - -|
\\_ | _ /
  `,
        `
___
  /   \\
|   |
\\___ /
  `,
        `
 _ _
  /   \\

\\_ _ /
  `,
        `
 _ _
  /   \\
 u sus
\\_ _ /
  `,
        `
 _ _
  /   \\
 u sus
\\_ _ /
  `,
        `


   u sus

    `,
        `

     u sus

      `,
        `
       u sus

        `
      ],
      [

      ]
    ],
    fire: [
      `
sus
  `,
      `
sus
  `,
      `
su
`,
      `
su
  `,
      `
s
  `
    ],
    smallFire: [
      `ඞ
`,
      `ඞ
  `,
      `ඞ
  `
    ],
    hit: [
      `

 susඞඞඞ

  `,
      `
 
 susඞඞ
  `,
      `
  %
%susඞ
 %
  `,
      `
 =
=susඞඞඞ
 =
`,
      `
  +
  +susඞඞ
  +
  `,
      `
  -
  -susඞ
  -
  `
    ],
    explosion: [
      `
ඞ     ඞ     ඞ     ඞ    
    ඞ      ඞ    ඞ      ඞ
ඞ     ඞ       ඞ        ඞ
   ඞ    ඞ      ඞ     ඞ
     ඞ       ඞ         ඞ
        ඞ       ඞ    
 ඞ     ඞ       ඞ   ඞ    
    ඞ         ඞ        ඞ
ඞ     ඞ      ඞ    ඞ
  `,
      `
ඞ  ඞ  ඞ ඞ   ඞ  ඞ  ඞ   ඞ
 ඞ  ඞ  ඞ ඞ ඞ  ඞ ඞ  ඞ   ඞ
ඞ ඞ   ඞ  ඞ    ඞ   ඞ    ඞ
   ඞ ඞ  ඞ   ඞ  ඞ ඞ   ඞ
 ඞ   ඞ    ඞ  ඞ     ඞ   ඞ
   ඞ    ඞ     ඞ ඞ   ඞ
 ඞ   ඞ ඞ    ඞ  ඞ  ඞඞ   ඞ
 ඞ  ඞ  ඞ ඞ ඞ  ඞ ඞ  ඞ ඞ ඞ
ඞ  ඞ  ඞ ඞ    ඞ  ඞ ඞ   ඞ
  `,
      `
ඞ %  % ඞ %  ඞ %   ඞ
 ඞ %  ඞ % ඞ  ඞ %  ඞ %
ඞ ඞ %  ඞ %   ඞ %
   ඞ %  ඞ %  ඞ %   ඞ
  %   %    ඞ  ඞ     ඞ   ඞ
   ඞ %     ඞ %   ඞ
 ඞ % ඞ %  ඞ %ඞ   ඞ
  %  ඞ % ඞ %  ඞ ඞ % ඞ %
ඞ %  ඞ %    ඞ % ඞ %
    `,
      `
    %  =  = ඞ =  ඞ %   ඞ
 ඞ %  ඞ % %  % =  ඞ =
ඞ %   =  ඞ =   %    =
   % =  %   %  ඞ %   ඞ
 =   %    %  ඞ     ඞ   ඞ
  %    =     % %   ඞ
 ඞ % ඞ %  %  =ඞ   ඞ
  %  ඞ  = % =  ඞ %  % ඞ =
%  =  ඞ %    %  % ඞ %
  `,
      `
=  +% + %   =  %  =   ඞ
 ඞ =  % = %  = +  % +
% =   +  % +   % +
   = +  =   =  % =   %
  -   =    +  =  +  =   ඞ
    %    = %   = %   %
 %ඞ  = %    =     +ඞ   ඞ
  -  % - = +  ඞ %  % % =
=  -  + =    =  + %   =
`,
      `
  -= - =      % +   ඞ
 ඞ +  = - =  + +  % +
% +  =    +   % +
  + -      +  %     %
  -   -    +  +     +   =
   % + % +     %
 =% - =    +      %   =
    % +    ඞ % +
  +  -  +      +  - % +
  `,
      `
  + +      +  -   +
 % -  +   +  - -  =   -
=     -  +    -   =    -
  -        -  =     =
-  -     -   +
   =    - =   -     =
 +=    +    -      =   +
    =    -    %      = -
  -     -      -    =   -
    `,
      `
    - -      -      -
 =     -   -       +
  +        -        +
  +     +
  -
  +      +         +
  -+    -           +   -
  +         =      +
    +
    `,
      `
                       
 =                 -
  -                 -
  -

  -      -         -

  -         =      -

    `,
      `

    -





    -

    `
    ]
  }
}